#!/usr/bin/env python 3
# -*- coding: utf-8 -*-

import sys

if __name__ == '__main__':
    school = {'1A': 35, '1Б': 27, '1В': 21, '1Г': 26, '1Д': 29,
              '2A': 32, '2Б': 34, '2В': 27, '2Г': 30, '2Д': 31,
              '3A': 33, '3Б': 24, '3В': 29, '3Г': 37, '3Д': 32,
              '4A': 29, '4Б': 28, '4В': 25, '4Г': 29, '4Д': 27,
              '5A': 32, '5Б': 26, '5В': 27, '5Г': 23, '5Д': 30,
              '6A': 25, '6Б': 27, '6В': 29, '6Г': 24, '6Д': 26,
              '7A': 26, '7Б': 24, '7В': 21, '7Г': 22, '7Д': 23,
              '8A': 25, '8Б': 27, '8В': 25, '8Г': 26, '8Д': 24,
              '9A': 22, '9Б': 21, '9В': 24, '9Г': 22,
              '10A': 21, '10Б': 20, '10В': 24, '11A': 21, '11Б': 21, '11В': 20
              }
    # а) в одном из классов изменилось кол-во учеников
    school['7Б'] = 21
    # б) в школе появился новый класс
    school['5Л'] = 15
    # в) в школе был расформирован класс
    del school['9Г']
    # г) посчитать сумму
    n = school.items()
    sum = 0
    for key, value in school.items():
        sum = sum + value
        print(key, '=', value)
    print(f"Общее количество учеников {sum}")